Documents/ДоговорОтветственногоСодержания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ДоговорОтветственногоСодержания</Name>
			<BasedOn>
				<xr:Item>Document.Собеседование</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыМестаСодержанияЖивотных</xr:Item>
				<xr:Item>AccumulationRegister.ЗаполненностьКомнат</xr:Item>
				<xr:Item>InformationRegister.ОпекуныУкотовителиПодопечных</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Укотовитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОпекуныУкотовители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собеседование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Собеседование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/НомераМикрочипов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НомераМикрочипов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерМикрочипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяДокументомУдостоверяющимЛичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФамилияЛатиницей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяЛатиницей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ДоговорОтветственногоСодержания/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Если НЕ Ссылка.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Макет = Документы.ДоговорОтветственногоСодержания.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорОтветственногоСодержания.Номер КАК Номер,
	|	ДоговорОтветственногоСодержания.Дата КАК Дата,
	|	ДоговорОтветственногоСодержания.Кошка.Код КАК НомерКарточки,
	|	ДоговорОтветственногоСодержания.Кошка.Наименование КАК Кличка,
	|	ДоговорОтветственногоСодержания.Кошка.Порода КАК Порода,
	|	ДоговорОтветственногоСодержания.Кошка.Окрас КАК Окрас,
	|	ДоговорОтветственногоСодержания.Кошка.Пол КАК Пол,
	|	ДоговорОтветственногоСодержания.Кошка.ТипШерсти КАК ТипШерсти,
	|	ВЫБОР
	|		КОГДА ДоговорОтветственногоСодержания.Кошка.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВЫБОР
	|					КОГДА МЕСЯЦ(&Период) = МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|							И ДЕНЬ(&Период) < ДЕНЬ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|						ТОГДА ГОД(&Период) - ГОД(ДоговорОтветственногоСодержания.Кошка.ДатаРождения) - 1
	|					КОГДА МЕСЯЦ(&Период) = МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|							И ДЕНЬ(&Период) > ДЕНЬ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|						ТОГДА ГОД(&Период) - ГОД(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|					КОГДА МЕСЯЦ(&Период) < МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|						ТОГДА ГОД(&Период) - ГОД(ДоговорОтветственногоСодержания.Кошка.ДатаРождения) - 1
	|					ИНАЧЕ ГОД(&Период) - ГОД(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|				КОНЕЦ
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК ВозрастЛет,
	|	ВЫБОР
	|		КОГДА ДоговорОтветственногоСодержания.Кошка.ДатаРождения <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ВЫБОР
	|					КОГДА ДЕНЬ(&Период) >= ДЕНЬ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|							И МЕСЯЦ(&Период) >= МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|						ТОГДА МЕСЯЦ(&Период) - МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|					КОГДА МЕСЯЦ(&Период) > МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|						ТОГДА МЕСЯЦ(&Период) - МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения) - 1
	|					КОГДА ДЕНЬ(&Период) >= ДЕНЬ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения)
	|						ТОГДА 12 - (МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения) - МЕСЯЦ(&Период))
	|					ИНАЧЕ 12 - (МЕСЯЦ(ДоговорОтветственногоСодержания.Кошка.ДатаРождения) - МЕСЯЦ(&Период) + 1)
	|				КОНЕЦ
	|		ИНАЧЕ -1
	|	КОНЕЦ КАК ВозрастМесяцев,
	|	НомераМикрочиповСрезПоследних.НомерМикрочипа КАК НомерМикрочипа,
	|	ДокументыФизическихЛицСрезПоследних.Серия КАК ПаспортСерия,
	|	ДокументыФизическихЛицСрезПоследних.Номер КАК ПаспортНомер,
	|	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи КАК ДатаВыдачи,
	|	ДокументыФизическихЛицСрезПоследних.СрокДействия КАК СрокДействия,
	|	ДокументыФизическихЛицСрезПоследних.КемВыдан КАК КемВыдан,
	|	ДокументыФизическихЛицСрезПоследних.КодПодразделения КАК КодПодразделения,
	|	ДоговорОтветственногоСодержания.Укотовитель.ФизическоеЛицо.Телефон КАК УкотовительТелефон,
	|	ДоговорОтветственногоСодержания.Укотовитель.ФизическоеЛицо.МестоЖительства КАК УкотовительМестоЖительства,
	|	ДоговорОтветственногоСодержания.Укотовитель.ФизическоеЛицо.Наименование КАК УкотовительФИО
	|ИЗ
	|	Документ.ДоговорОтветственногоСодержания КАК ДоговорОтветственногоСодержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераМикрочипов.СрезПоследних(&Период, ) КАК НомераМикрочиповСрезПоследних
	|		ПО ДоговорОтветственногоСодержания.Кошка = НомераМикрочиповСрезПоследних.Кошка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(&Период, ) КАК ДокументыФизическихЛицСрезПоследних
	|		ПО ДоговорОтветственногоСодержания.Укотовитель.ФизическоеЛицо = ДокументыФизическихЛицСрезПоследних.ФизическоеЛицо
	|ГДЕ
	|	ДоговорОтветственногоСодержания.Ссылка = &Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка[0]);
	Запрос.Параметры.Вставить("Период", ТекущаяДатаСеанса());
	
	РезультатЗапроса =  Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначения.СообщитьПользователю("Ошибка заполнения договора!");
	КонецЕсли;
	Выборка =РезультатЗапроса.Выбрать();
	
	ТабДок.Очистить();
	
	Если Выборка.Следующий() Тогда
	
	//////////////////////////// ЗАГОЛОВОК //////////////////////
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ТабДок.Вывести(ОбластьЗаголовок);
	////////////////////////////
	
	//////////////////////////// ШАПКА ///////////////////////////
	ОбластьШапкаДоговора = Макет.ПолучитьОбласть("ШапкаДоговора");
	ОбластьШапкаДоговора.Параметры.ДатаДоговора = Выборка.Дата;
	ОбластьШапкаДоговора.Параметры.НомерДоговора = Выборка.Номер;
	
	ОбластьШапкаДоговора.Параметры.ПолноеНаименованиеОрганизации = Константы.ПолноеНаименованиеОрганизации.Получить();
	ОбластьШапкаДоговора.Параметры.УкотовительФИО = Выборка.УкотовительФИО;	 
	
	Табдок.Вывести(ОбластьШапкаДоговора);
	//////////////////////////////////////////////////////////////
	
	//////////////////////////// ПРЕДМЕТ ДОГОВОРА ///////////////////////////
	Если НЕ(ЗначениеЗаполнено(Выборка.Пол)
		И Выборка.ВозрастЛет <> -1
		И Выборка.ВозрастМесяцев <> -1
		И ЗначениеЗаполнено(Выборка.Окрас)
		И ЗначениеЗаполнено(Выборка.ТипШерсти)
		И ЗначениеЗаполнено(Выборка.Порода)
		И ЗначениеЗаполнено(Выборка.НомерМикрочипа)) Тогда
		ВызватьИсключение "Не заполнены обязательные сведения о подопечном! Проверьте:
		|Пол, Дата рождения, Окрас, Тип шерсти, Порода, Номер чипа";
	КонецЕсли;
	
	
	ОбластьПредметДоговора = Макет.ПолучитьОбласть("ПредметДоговора"); 
	ОбластьПредметДоговора.Параметры.НомерКарточки = Выборка.НомерКарточки;
	ОбластьПредметДоговора.Параметры.Кличка = Выборка.Кличка;
	ОбластьПредметДоговора.Параметры.Пол = Выборка.Пол;
	Если Выборка.ВозрастЛет > 0 Тогда
		Возраст = СтрШаблон("%1 г. %2 мес.", Выборка.ВозрастЛет, Выборка.ВозрастМесяцев);
	Иначе
		Возраст = СтрШаблон("%1 мес.", Выборка.ВозрастМесяцев);
	КонецЕсли;
	ОбластьПредметДоговора.Параметры.Возраст = Возраст;
	ОбластьПредметДоговора.Параметры.Окрас = Выборка.Окрас;
	ОбластьПредметДоговора.Параметры.Шерсть = Выборка.ТипШерсти;
	ОбластьПредметДоговора.Параметры.Порода = Выборка.Порода;
	ОбластьПредметДоговора.Параметры.НомерЧипа = Выборка.НомерМикрочипа;
	
	
	ТабДок.Вывести(ОбластьПредметДоговора);
	//////////////////////////////////////////////////////////////
	
	//////////////////////////////////////////////////////////////
	ОбластьПраваОбязанностиСторон = Макет.ПолучитьОбласть("ПраваОбязанностиСторон");
	Если НЕ(ЗначениеЗаполнено(Выборка.УкотовительМестоЖительства)) Тогда
		ВызватьИсключение "Не заполнено место жительство укотовителя (адрес содержания)!";
	КонецЕсли;
	ОбластьПраваОбязанностиСторон.Параметры.УкотовительМестоЖительства = Выборка.УкотовительМестоЖительства;
	
	ОбластьОтветственностьСторон = Макет.ПолучитьОбласть("ОтветственностьСторон");
	ОбластьПорядокРазрешенияСпоров = Макет.ПолучитьОбласть("ПорядокРазрешенияСпоров");
	ОбластьДействиеДоговора = Макет.ПолучитьОбласть("ДействиеДоговора");
	
	ТабДок.Вывести(ОбластьПраваОбязанностиСторон);
	ТабДок.Вывести(ОбластьОтветственностьСторон);
	ТабДок.Вывести(ОбластьПорядокРазрешенияСпоров);
	ТабДок.Вывести(ОбластьДействиеДоговора);
	//////////////////////////////////////////////////////////////
	
	ОбластьРеквизитыСторон = Макет.ПолучитьОбласть("РеквизитыСторон");
	ОбластьРеквизитыСторон.Параметры.ИНН     = Константы.ИНН.Получить();
	ОбластьРеквизитыСторон.Параметры.ОГРН    = Константы.ОГРН.Получить();
	ОбластьРеквизитыСторон.Параметры.Телефон = Константы.ТелефонОрганизации.Получить();
	ОбластьРеквизитыСторон.Параметры.АдресЭП  = Константы.АдресЭлектроннойПочтыОрганизации.Получить();

	Если НЕ(ЗначениеЗаполнено(Выборка.ПаспортНомер)
		И ЗначениеЗаполнено(Выборка.ДатаВыдачи)
		И ЗначениеЗаполнено(Выборка.УкотовительТелефон)) Тогда
		ВызватьИсключение "Не заполнены обязательные сведения об укотовителе! Проверьте:
		|Номер, Дата выдачи документа, уд. личность; Телефон";
	КонецЕсли;
	
	ОбластьРеквизитыСторон.Параметры.УкотовительФИО = Выборка.УкотовительФИО;
	ОбластьРеквизитыСторон.Параметры.ПаспортСерия   = Выборка.ПаспортСерия;
	ОбластьРеквизитыСторон.Параметры.ПаспортНомер   = Выборка.ПаспортНомер;
	ОбластьРеквизитыСторон.Параметры.ПаспортВыдан   = СтрШаблон("%1, %2", Выборка.КемВыдан, Выборка.ДатаВыдачи);
	ОбластьРеквизитыСторон.Параметры.УкотовительТелефон = Выборка.УкотовительТелефон;
	
	ТабДок.Вывести(ОбластьРеквизитыСторон);
	КонецЕсли;

КонецПроцедуры
